Herimarque-soap-client/src/test/resources/area_list_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:head="http://apache.org/headers" xmlns:ser="http://service.areacrlts.crlts.cha/">
   <soapenv:Header>
      <head:ComMsgHeader>
         <RequestMsgID>netinamu42</RequestMsgID>
         <ServiceKey>6i1zuQWddVTMFSqlHyhnbw8VL7uvfuHHt3Pth12H3VuFrUvdzFRcfYBZRfTE0Eidf/hV3otAz36MR1F/VDWUDw==</ServiceKey>
      </head:ComMsgHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ser:getAreaCrltsList>
         <arg0>
           <ctrdCd>code</ctrdCd>
           <pageMg>size</pageMg>
           <nowPageNo>pagenum</nowPageNo>
         </arg0>
      </ser:getAreaCrltsList>
   </soapenv:Body>
</soapenv:Envelope>